rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_ME.h
#define MC_ME_PRTN1_COFB3_STAT_BLOCK102_MASK     (0x40U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK102_SHIFT    (6U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK102_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK102(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK102_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK102_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK103_MASK     (0x80U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK103_SHIFT    (7U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK103_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK103(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK103_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK103_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK104_MASK     (0x100U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK104_SHIFT    (8U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK104_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK104(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK104_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK104_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK105_MASK     (0x200U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK105_SHIFT    (9U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK105_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK105(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK105_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK105_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK106_MASK     (0x400U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK106_SHIFT    (10U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK106_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK106(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK106_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK106_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK107_MASK     (0x800U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK107_SHIFT    (11U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK107_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK107(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK107_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK107_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK108_MASK     (0x1000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK108_SHIFT    (12U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK108_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK108(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK108_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK108_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK110_MASK     (0x4000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK110_SHIFT    (14U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK110_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK110(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK110_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK110_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK112_MASK     (0x10000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK112_SHIFT    (16U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK112_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK112(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK112_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK112_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK113_MASK     (0x20000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK113_SHIFT    (17U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK113_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK113(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK113_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK113_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK114_MASK     (0x40000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK114_SHIFT    (18U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK114_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK114(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK114_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK114_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK115_MASK     (0x80000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK115_SHIFT    (19U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK115_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK115(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK115_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK115_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK116_MASK     (0x100000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK116_SHIFT    (20U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK116_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK116(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK116_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK116_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK117_MASK     (0x200000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK117_SHIFT    (21U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK117_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK117(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK117_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK117_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK118_MASK     (0x400000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK118_SHIFT    (22U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK118_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK118(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK118_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK118_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK119_MASK     (0x800000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK119_SHIFT    (23U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK119_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK119(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK119_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK119_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK120_MASK     (0x1000000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK120_SHIFT    (24U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK120_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK120(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK120_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK120_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK121_MASK     (0x2000000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK121_SHIFT    (25U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK121_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK121(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK121_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK121_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK122_MASK     (0x4000000U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK122_SHIFT    (26U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK122_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK122(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK122_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK122_MASK)

