rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_ME.h
#define MC_ME_PRTN1_COFB3_CLKEN_REQ96_MASK       (0x1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ96_SHIFT      (0U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ96_WIDTH      (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ96(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ96_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ96_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ102_MASK      (0x40U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ102_SHIFT     (6U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ102_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ102(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ102_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ102_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ104_MASK      (0x100U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ104_SHIFT     (8U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ104_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ104(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ104_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ104_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ112_MASK      (0x10000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ112_SHIFT     (16U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ112_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ112(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ112_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ112_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ113_MASK      (0x20000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ113_SHIFT     (17U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ113_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ113(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ113_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ113_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ114_MASK      (0x40000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ114_SHIFT     (18U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ114_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ114(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ114_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ114_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ115_MASK      (0x80000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ115_SHIFT     (19U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ115_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ115(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ115_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ115_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ116_MASK      (0x100000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ116_SHIFT     (20U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ116_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ116(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ116_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ116_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ117_MASK      (0x200000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ117_SHIFT     (21U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ117_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ117(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ117_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ117_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ118_MASK      (0x400000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ118_SHIFT     (22U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ118_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ118(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ118_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ118_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ119_MASK      (0x800000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ119_SHIFT     (23U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ119_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ119(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ119_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ119_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ120_MASK      (0x1000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ120_SHIFT     (24U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ120_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ120(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ120_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ120_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ121_MASK      (0x2000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ121_SHIFT     (25U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ121_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ121(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ121_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ121_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ122_MASK      (0x4000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ122_SHIFT     (26U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ122_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ122(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ122_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ122_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ123_MASK      (0x8000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ123_SHIFT     (27U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ123_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ123(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ123_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ123_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ124_MASK      (0x10000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ124_SHIFT     (28U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ124_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ124(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ124_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ124_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ125_MASK      (0x20000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ125_SHIFT     (29U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ125_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ125(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ125_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ125_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ126_MASK      (0x40000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ126_SHIFT     (30U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ126_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ126(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ126_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ126_MASK)

#define MC_ME_PRTN1_COFB3_CLKEN_REQ127_MASK      (0x80000000U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ127_SHIFT     (31U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ127_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_CLKEN_REQ127(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_CLKEN_REQ127_SHIFT)) & MC_ME_PRTN1_COFB3_CLKEN_REQ127_MASK)
/*! @} */

