rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_ME.h
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_MASK      (0x8000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_SHIFT     (15U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK79_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK79_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_MASK      (0x10000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_SHIFT     (16U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK80_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK80_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_MASK      (0x20000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_SHIFT     (17U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK81_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK81_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_MASK      (0x40000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_SHIFT     (18U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK82_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK82_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_MASK      (0x80000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_SHIFT     (19U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK83_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK83_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_MASK      (0x100000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_SHIFT     (20U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK84_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK84_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_MASK      (0x200000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_SHIFT     (21U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK85_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK85_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_MASK      (0x400000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_SHIFT     (22U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK86_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK86_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_MASK      (0x800000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_SHIFT     (23U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK87_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK87_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_MASK      (0x1000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_SHIFT     (24U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK88_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK88_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_MASK      (0x2000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_SHIFT     (25U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK89_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK89_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_MASK      (0x4000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_SHIFT     (26U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK90_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK90_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK91_MASK      (0x8000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK91_SHIFT     (27U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK91_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK91(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK91_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK91_MASK)
/*! @} */

/*! @name PRTN2_COFB0_CLKEN - Partition 2 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_MASK        (0x10U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_SHIFT       (4U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ4_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ4_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_MASK        (0x20U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_SHIFT       (5U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ5_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ5_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_MASK        (0x40U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_SHIFT       (6U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ6_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ6_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_MASK        (0x80U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_SHIFT       (7U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ7_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ7_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_MASK        (0x100U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_SHIFT       (8U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ8_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ8_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_MASK        (0x200U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_SHIFT       (9U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ9_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ9_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_MASK       (0x400U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_SHIFT      (10U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ10_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ10_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_MASK       (0x800U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_SHIFT      (11U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ11_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ11_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_MASK       (0x1000U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_SHIFT      (12U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ12_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ12_MASK)

