rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_ME.h
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_MASK       (0x10U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_SHIFT      (4U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ36_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ36_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_MASK       (0x20U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_SHIFT      (5U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ37_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ37_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ38_MASK       (0x40U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ38_SHIFT      (6U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ38_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ38(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ38_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ38_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ39_MASK       (0x80U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ39_SHIFT      (7U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ39_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ39(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ39_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ39_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ40_MASK       (0x100U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ40_SHIFT      (8U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ40_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ40(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ40_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ40_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ41_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_MASK       (0x10000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_SHIFT      (16U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ48_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ48_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_MASK       (0x4000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_SHIFT      (26U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ58_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ58_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_MASK       (0x40000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_SHIFT      (30U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ62_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ62_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN2_COFB2_CLKEN - Partition 2 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_MASK       (0x1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_SHIFT      (0U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ64_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ64_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK       (0x10U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT      (4U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK       (0x20U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT      (5U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_MASK       (0x40U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_SHIFT      (6U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ70_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ70_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_MASK       (0x100U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_SHIFT      (8U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ72_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ72_MASK)

