rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_ME.h
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_MASK       (0x200U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_SHIFT      (9U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ73_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ73_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_MASK       (0x400U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_SHIFT      (10U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ74_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ74_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_MASK       (0x800U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_SHIFT      (11U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ75_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ75_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_MASK       (0x1000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_SHIFT      (12U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ76_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ76_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_MASK       (0x2000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_SHIFT      (13U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ77_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ77_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_MASK       (0x4000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_SHIFT      (14U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ78_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ78_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_MASK       (0x8000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_SHIFT      (15U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ79_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ79_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_MASK       (0x10000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_SHIFT      (16U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ80_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ80_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_MASK       (0x20000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_SHIFT      (17U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ81_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ81_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_MASK       (0x40000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_SHIFT      (18U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ82_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ82_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_MASK       (0x80000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_SHIFT      (19U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ83_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ83_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_MASK       (0x100000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_SHIFT      (20U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ84_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ84_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_MASK       (0x200000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_SHIFT      (21U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ85_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ85_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_MASK       (0x400000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_SHIFT      (22U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ86_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ86_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_MASK       (0x800000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_SHIFT      (23U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ87_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ87_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_MASK       (0x1000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_SHIFT      (24U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ88_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ88_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_MASK       (0x2000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_SHIFT      (25U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ89_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ89_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_MASK       (0x4000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_SHIFT      (26U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ90_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ90_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_MASK       (0x8000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_SHIFT      (27U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ91_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ91_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MC_ME_Register_Masks */

/*!
 * @}
 */ /* end of group MC_ME_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_MC_ME_H_) */
